{
  "Logging": {
    "LogLevel": {
      "Default": "Information",
      "Microsoft.AspNetCore": "Warning"
    }
  },
  "AllowedHosts": "*",

  "ConnectionStrings": {
    "SGBDatabase": "Server=DESKTOP-NKLD521;Database=SGB;Integrated Security=True;TrustServerCertificate=True;"
  },

  "ErrorMessages": {
    "Global": {
      "UnexpectedError": "Ocurrió un error inesperado. Por favor, contacte al soporte técnico.",
      "ValidationError": "Uno o más datos proporcionados no son válidos.",
      "ResourceNotFound": "El recurso solicitado no fue encontrado."
    },
    "BaseRepository": {
      "AddError": "Ocurrió un error inesperado al intentar agregar la entidad.",
      "UpdateError": "Ocurrió un error inesperado al intentar actualizar la entidad.",
      "DeleteError": "Ocurrió un error inesperado al intentar eliminar la entidad.",
      "GetError": "Ocurrió un error inesperado al obtener los datos."
    },
    "Libros": {
      "GetById": "Error al obtener el libro por su ISBN.",
      "GetAll": "Error al obtener la lista de libros.",
      "Add": "Error al registrar el nuevo libro en la base de datos.",
      "Update": "Error al actualizar la información del libro.",
      "Delete": "Error al realizar la eliminación lógica del libro.",
      "IsbnAlreadyExists": "El ISBN proporcionado ya existe en el sistema.",
      "BookIsOnLoan": "La operación no se puede completar porque el libro está actualmente prestado."
    },
    "Usuarios": {
      "GetById": "Error al obtener el usuario.",
      "Add": "Error al registrar el nuevo usuario.",
      "Update": "Error al actualizar la información del usuario.",
      "Deactivate": "Error al desactivar la cuenta del usuario.",
      "EmailAlreadyExists": "El correo electrónico proporcionado ya se encuentra registrado.",
      "HasActiveLoans": "La cuenta no puede ser desactivada porque el usuario tiene préstamos activos."
    },
    "Prestamos": {
      "Add": "Error al registrar el nuevo préstamo.",
      "Return": "Error al procesar la devolución del libro.",
      "BookNotAvailable": "El libro solicitado no se encuentra disponible para préstamo.",
      "UserHasPenalties": "El usuario no puede solicitar nuevos préstamos porque tiene penalizaciones activas.",
      "UserNotActive": "El usuario no tiene una cuenta activa y no puede solicitar préstamos.",
      "LoanNotFound": "El préstamo que intenta modificar o devolver no fue encontrado."
    },
    "Notificaciones": {
      "GenerateError": "Ocurrió un error al generar las notificaciones automáticas."
    }
  }
}
